/**
 * Task6_1
 */
public class Task6_1 {

// 1. Напишите метод, который заполнит массив из 99 элементов случайными цифрами от 0 до 50.

// 2. Создайте метод, в который передайте заполненный выше массив и с помощью Set вычислите процент уникальных значений 
// в данном массиве и верните его в виде числа с плавающей запятой.

// Для вычисления процента используйте формулу:

// процент уникальных чисел = количество уникальных чисел * 100 / общее количество чисел в массиве.

    public static void main(String[] args) {
        
    }
}